<a href="https://colab.research.google.com/github/economicactivist/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
import pandas as pd
import numpy as np
import seaborn as sns

!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

In [9]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

tar (child): instacart_online_grocery_shopping_2017_05_01.tar.gz: Cannot open: No such file or directory
tar (child): Error is not recoverable: exiting now
tar: Child returned status 2
tar: Error is not recoverable: exiting now

In [10]:
%cd instacart_2017_05_01

[Errno 2] No such file or directory: 'instacart_2017_05_01'
/content/instacart_2017_05_01

In [11]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
aisles = pd.read_csv('aisles.csv')
departments = pd.read_csv('departments.csv')
order_products__prior = pd.read_csv('order_products__prior.csv')
order_products__train = pd.read_csv('order_products__train.csv')
orders = pd.read_csv('orders.csv')
products = pd.read_csv('products.csv')

In [13]:
aisles.head() #not needed

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [14]:
departments.head() #not needed

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [15]:
order_products__prior.head()  #to concat (or append)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [16]:
order_products__train.head()  #to concat (or append)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [17]:
orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [18]:
products.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

##These are the top 10 most frequently ordered products. How many times was each ordered?

In [19]:
#append o_p__train to o_p__prior

order_products__train.append(order_products__prior, ignore_index=True)

          order_id  product_id  add_to_cart_order  reordered
0                1       49302                  1          1
1                1       11109                  2          1
2                1       10246                  3          0
3                1       49683                  4          0
4                1       43633                  5          1
...            ...         ...                ...        ...
33819101   3421083       39678                  6          1
33819102   3421083       11352                  7          0
33819103   3421083        4600                  8          0
33819104   3421083       24852                  9          1
33819105   3421083        5020                 10          1

[33819106 rows x 4 columns]

In [0]:
order_products_combined = order_products__train.append(order_products__prior, ignore_index=True)

In [21]:
#concat o_p_combined with products

pd.merge(order_products_combined, products, on="product_id")

          order_id  product_id  ...  aisle_id  department_id
0                1       49302  ...       120             16
1           816049       49302  ...       120             16
2          1242203       49302  ...       120             16
3          1383349       49302  ...       120             16
4          1787378       49302  ...       120             16
...            ...         ...  ...       ...            ...
33819101   3265099       43492  ...       104             13
33819102   3361945       43492  ...       104             13
33819103   3267201       33097  ...        81             15
33819104   3393151       38977  ...       100             21
33819105   3400803       23624  ...        79              1

[33819106 rows x 7 columns]

# assign merge to variable

In [0]:
products_ordered = pd.merge(order_products_combined, products, on="product_id")

#Solution to first question: How many times was each product ordered?

In [31]:
products_ordered.product_name.value_counts()[:10]

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [24]:


table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [32]:
# table2 -> tidy
table2_tidy = table2.T

table2_tidy

              treatmenta  treatmentb
John Smith           NaN         2.0
Jane Doe            16.0        11.0
Mary Johnson         3.0         1.0




##place the names in their own column, reset index, and rename first column "name"

In [39]:
table2_tidy.reset_index().rename({'index':'name'}, axis="columns")

           name  treatmenta  treatmentb
0    John Smith         NaN         2.0
1      Jane Doe        16.0        11.0
2  Mary Johnson         3.0         1.0

In [0]:
table2_tidy = table2_tidy.reset_index().rename({'index':'name'}, axis="columns")

#Solution to: Change table2 to tidy form [using transpose]

In [41]:
pd.melt(table2_tidy,id_vars='name', value_vars=['treatmenta','treatmentb'])

           name    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [0]:
table2_solution1 = pd.melt(table2_tidy,id_vars='name', value_vars=['treatmenta','treatmentb'])

In [84]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [86]:
table2.stack()  Change data frame to multi-index Series

treatmenta  Jane Doe        16.0
            Mary Johnson     3.0
treatmentb  John Smith       2.0
            Jane Doe        11.0
            Mary Johnson     1.0
dtype: float64

In [88]:
pd.DataFrame(table2.stack(dropna=False))  #Change multi-index series back to DataFrame [don't drop NaN values]

                            0
treatmenta John Smith     NaN
           Jane Doe      16.0
           Mary Johnson   3.0
treatmentb John Smith     2.0
           Jane Doe      11.0
           Mary Johnson   1.0

In [89]:
pd.DataFrame(table2.stack(dropna=False)).rename({0:"value"}, axis="columns") # rename column

                         value
treatmenta John Smith      NaN
           Jane Doe       16.0
           Mary Johnson    3.0
treatmentb John Smith      2.0
           Jane Doe       11.0
           Mary Johnson    1.0

In [90]:
pd.DataFrame(table2.stack(dropna=False)).rename({0:"value"}, axis="columns").reset_index()  #reset index

      level_0       level_1  value
0  treatmenta    John Smith    NaN
1  treatmenta      Jane Doe   16.0
2  treatmenta  Mary Johnson    3.0
3  treatmentb    John Smith    2.0
4  treatmentb      Jane Doe   11.0
5  treatmentb  Mary Johnson    1.0

In [0]:
table2_to_rename = pd.DataFrame(table2.stack(dropna=False)).rename({0:"value"}, axis="columns").reset_index()

In [0]:
table2_to_rename.columns=['level_1', 'level_0', 'value'] #reorder columns

#Solution to: Change table2 to tidy form [without using transpose]

In [105]:
table2_to_rename.rename({"level_1":"treatment", "level_0":"name"}, axis="columns")

    treatment          name  value
0  treatmenta    John Smith    NaN
1  treatmenta      Jane Doe   16.0
2  treatmenta  Mary Johnson    3.0
3  treatmentb    John Smith    2.0
4  treatmentb      Jane Doe   11.0
5  treatmentb  Mary Johnson    1.0

In [0]:
table2_solution2 = table2_to_rename.rename({"level_1":"treatment", "level_0":"name"}, axis="columns")

In [156]:
# tidy -> table2
pd.pivot_table(table2_solution2, values='value', index='treatment', columns=['name'])

name        Jane Doe  John Smith  Mary Johnson
treatment
treatmenta      16.0         NaN           3.0
treatmentb      11.0         2.0           1.0

## remove index and column names

In [159]:
pd.pivot_table(table2_solution2, values='value', index='treatment', columns=['name']).rename_axis(None).rename_axis(None,axis=1)

            Jane Doe  John Smith  Mary Johnson
treatmenta      16.0         NaN           3.0
treatmentb      11.0         2.0           1.0

## Solution: Tidy to Table2

In [0]:
tidy_to_untidy = pd.pivot_table(table2_solution2, values='value', index='treatment', columns=['name']).rename_axis(None).rename_axis(None,axis=1)

In [0]:
flights = sns.load_dataset('flights')

In [162]:
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [163]:
flights.pivot_table(values='passengers', index='year', columns='month')

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

In [0]:
# Flights Pivot Table

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####